In [2]:
import pandas as pd

In [3]:
#List to Series with default index
s = pd.Series([1,2,3])
print(s)

0    1
1    2
2    3
dtype: int64

In [5]:
S = pd.Series() #Empty series 
print(S)

Series([], dtype: float64)

/tmp/ipykernel_6911/3780755642.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  S = pd.Series()

In [6]:
ss = pd.Series([1,2,3], index = ['a', 'b', 'c'])
print(ss)

a    1
b    2
c    3
dtype: int64

In [8]:
#Dictionary to Series
SS = pd.Series({'a':1, 'b':2, 'c':3})
print(SS)

a    1
b    2
c    3
dtype: int64

In [10]:
sss = pd.Series((1,2,3,4), index=['a', 'b', 'c', 'd'])
print(sss)

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
print(sss['d'])

4

In [19]:
print(sss[:3])

a    1
b    2
c    3
dtype: int64

In [23]:
print(sss[['a','d']])

a    1
d    4
dtype: int64

In [29]:
print(sss[sss>2])

c    3
d    4
dtype: int64

In [28]:
print([sss>2])

[a    False
b    False
c     True
d     True
dtype: bool]

In [30]:
print(sss*2)

a    2
b    4
c    6
d    8
dtype: int64

In [41]:
data = {
    'Name':['Guru', 'Rajendra', 'Om', 'Sourav','Sai'],
    'Age': [21,21,21,20,21],
    'City':['Cuttack','Angul','Jamshedpur','Balasore','BBSR']
}

df = pd.DataFrame(data)
print(df)

       Name  Age        City
0      Guru   21     Cuttack
1  Rajendra   21       Angul
2        Om   21  Jamshedpur
3    Sourav   20    Balasore
4       Sai   21        BBSR

In [42]:
print(df.shape)
print()
print(df.info())#rw-rw-r--1
print()
print(df.describe())

(5, 3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes
None

             Age
count   5.000000
mean   20.800000
std     0.447214
min    20.000000
25%    21.000000
50%    21.000000
75%    21.000000
max    21.000000

In [46]:
print(df['Name'],"\n")
print(df[['Name','Age']],"\n")
print(df.iloc[0],"\n")
print(df.loc[0,'Name'],"\n")

0        Guru
1    Rajendra
2          Om
3      Sourav
4         Sai
Name: Name, dtype: object

       Name  Age
0      Guru   21
1  Rajendra   21
2        Om   21
3    Sourav   20
4       Sai   21

Name       Guru
Age          21
City    Cuttack
Name: 0, dtype: object

Guru

In [5]:
#Series with nd Array
import pandas as pd
import numpy as np

arr = np.array([10,20,30])
s = pd.Series(arr)
print(s)

0    10
1    20
2    30
dtype: int64

In [9]:
#Series with Mutable index
ar = np.array(['a','b',1,2])
ss = pd.Series(ar, index=['1','2','3','4'])
print(ss)

1    a
2    b
3    1
4    2
dtype: object

In [11]:
#Creating Series from Scalar Values
S = pd.Series('Rajendra',index=[0,1,2,3,4,5,6,7,8,9])
print(S)

0    Rajendra
1    Rajendra
2    Rajendra
3    Rajendra
4    Rajendra
5    Rajendra
6    Rajendra
7    Rajendra
8    Rajendra
9    Rajendra
dtype: object

In [24]:
ar1 = np.array([1,2,3,4])
ar2 = np.array([10,20,30,40])
ar3 = np.array([1,2,3,4,5])
s1 = pd.Series(ar1,index=['1','2','3','4'])
s2 = pd.Series(ar2,index=['1','2','3','4'])
s3 = pd.Series(ar3,index=['1','2','3','4','5'])
print(s1,"\n")
print(s2,"\n")
print(s1+s2,"\n")
print(s2+s3,"\n")
print(s2.add(s3,fill_value=50))

1    1
2    2
3    3
4    4
dtype: int64

1    10
2    20
3    30
4    40
dtype: int64

1    11
2    22
3    33
4    44
dtype: int64

1    11.0
2    22.0
3    33.0
4    44.0
5     NaN
dtype: float64

1    11.0
2    22.0
3    33.0
4    44.0
5    55.0
dtype: float64

In [27]:
arr = np.array([61,51,31,41,71,21,81])
s = pd.Series(arr)
print(s.head())
print(s.head(3))
print(s.tail())
print(s.tail(1))

0    61
1    51
2    31
3    41
4    71
dtype: int64
0    61
1    51
2    31
dtype: int64
2    31
3    41
4    71
5    21
6    81
dtype: int64
6    81
dtype: int64

In [30]:
arr =np.array([10,20,30,40,50,60,70])
s = pd.Series(arr)
print(s)
print(s.loc[:2]) #inclusive of 2 as it just do indexing
print(s.iloc[:2]) #exclusive of 2 as it do +1 and py ignores last
print(s.loc[3:4])
print(s.iloc[3:4])
print(s.loc[2:3])

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64
0    10
1    20
2    30
dtype: int64
0    10
1    20
dtype: int64
3    40
4    50
dtype: int64
3    40
dtype: int64
2    30
3    40
dtype: int64

In [31]:
dicti = {
    'Name':['Guru', 'Rajendra', 'Om', 'Sourav','Sai'],
    'Age': [21,21,21,20,21],
    'City':['Cuttack','Angul','Jamshedpur','Balasore','BBSR']
}

s = pd.Series(dicti)
print(s)

Name               [Guru, Rajendra, Om, Sourav, Sai]
Age                             [21, 21, 21, 20, 21]
City    [Cuttack, Angul, Jamshedpur, Balasore, BBSR]
dtype: object

In [6]:
import pandas as pd
import numpy as np
tuplee = ("Rajendra", 20)
s = pd.Series(tuplee)
print(s)
print(s.index)

0    Rajendra
1          20
dtype: object
RangeIndex(start=0, stop=2, step=1)

In [7]:
s= pd.Series(['a','b','c'])
df = pd.DataFrame(s)
print(df)

   0
0  a
1  b
2  c

In [9]:
name = pd.Series(["Rajendra","Aryan"])
char = pd.Series([8,5])
alias = pd.Series(["NIL","NIL"])
dicti = {"Name": name, "Char": char, "Alias":alias}
df = pd.DataFrame(dicti)
print(df)

       Name  Char Alias
0  Rajendra     8   NIL
1     Aryan     5   NIL

In [20]:
dicti = [
    {"D1":"D11","D2":"D22","D3":"D33"},
    {"D1":"F11","D2":"F22","D3":"F33"},
    {"D1":"G11","D2":"G22","D3":"G33"},
]
df =pd.DataFrame(dicti)
print(df,"\n")
print(df[['D1','D3']])

    D1   D2   D3
0  D11  D22  D33
1  F11  F22  F33
2  G11  G22  G33

    D1   D3
0  D11  D33
1  F11  F33
2  G11  G33

In [21]:
for(index, val) in df.iterrows(): #rows
    print("\nRow index is: ", index)
    print("Row Value is: ")
    print(val)

Row index is:  0
Row Value is:
D1    D11
D2    D22
D3    D33
Name: 0, dtype: object

Row index is:  1
Row Value is:
D1    F11
D2    F22
D3    F33
Name: 1, dtype: object

Row index is:  2
Row Value is:
D1    G11
D2    G22
D3    G33
Name: 2, dtype: object

In [22]:
for(index, val) in df.items():  #cols
    print("\nColumn name is: ", index)
    print("Column value is: ")
    print(val)

Column name is:  D1
Column value is:
0    D11
1    F11
2    G11
Name: D1, dtype: object

Column name is:  D2
Column value is:
0    D22
1    F22
2    G22
Name: D2, dtype: object

Column name is:  D3
Column value is:
0    D33
1    F33
2    G33
Name: D3, dtype: object

In [23]:
emp = {
    'empID':[101,102,103,104,105],
    'ename':['A','B','C','D','E'],
    'Dept': ['D1','D2','D3','D4','D5']
}
df = pd.DataFrame(emp)
print(df)

   empID ename Dept
0    101     A   D1
1    102     B   D2
2    103     C   D3
3    104     D   D4
4    105     E   D5

In [24]:
df.empID

0    101
1    102
2    103
3    104
4    105
Name: empID, dtype: int64

In [25]:
df['empID']

0    101
1    102
2    103
3    104
4    105
Name: empID, dtype: int64

In [27]:
df[['empID','ename','Dept']]

   empID ename Dept
0    101     A   D1
1    102     B   D2
2    103     C   D3
3    104     D   D4
4    105     E   D5

In [47]:
s = pd.Series([10,20,30,40,50])
df = pd.DataFrame(s)
print(df,"\n")
df.columns=['MLC'] #To remove the default col of data frame as list1
print(df,"\n")
df['Python']=[100,200,300,500,400] #To create a new col List2 with all values as 20
print(df,"\n")
df['Total'] = df['MLC']+df['Python'] #Add col1 and col2 and store in col3
print(df,"\n")

    0
0  10
1  20
2  30
3  40
4  50

   MLC
0   10
1   20
2   30
3   40
4   50

   MLC  Python
0   10     100
1   20     200
2   30     300
3   40     500
4   50     400

   MLC  Python  Total
0   10     100    110
1   20     200    220
2   30     300    330
3   40     500    540
4   50     400    450

In [32]:
del df['Python']

In [33]:
print(df)

   MLC  Total
0   10    110
1   20    220
2   30    330
3   40    540
4   50    450

In [37]:
df.pop('MLC')
print(df)

In [44]:
df.pop('Python')
print(df)

   MLC
0   10
1   20
2   30
3   40
4   50

In [48]:
df = df.drop(columns='Total')
print(df)

   MLC  Python
0   10     100
1   20     200
2   30     300
3   40     500
4   50     400

In [52]:
s = pd.Series([10,20,30,40,50])
df = pd.DataFrame(s)
df.columns = ['List1']
df['List2'] = [10,20,30,40,50]
df1 = df.drop('List2', axis=1) #means to del data column wise
df2 = df.drop(index = [2,3], axis=0) # means to del data row wise
print(df1)
print(df2)

   List1
0     10
1     20
2     30
3     40
4     50
   List1  List2
0     10     10
1     20     20
4     50     50

In [55]:
dicti = {
    "D":{"D1":"D11","D2":"D22","D3":"D33"},
    "E":{"D1":"F11","D2":"F22","D3":"F33"},
    "F":{"D1":"G11","D2":"G22","D3":"G33"},
}
df = pd.DataFrame(dicti)
print(df)
print(df.loc['D2',:]) #only D2 row
print(df.loc['D1':'D2',:]) #only rows from D1 to D3

      D    E    F
D1  D11  F11  G11
D2  D22  F22  G22
D3  D33  F33  G33
D    D22
E    F22
F    G22
Name: D2, dtype: object
      D    E    F
D1  D11  F11  G11
D2  D22  F22  G22

In [56]:
print(df.loc[:,'E'])
print(df.loc[:,'D':'E'])

D1    F11
D2    F22
D3    F33
Name: E, dtype: object
      D    E
D1  D11  F11
D2  D22  F22
D3  D33  F33

In [73]:
emp = {
    'empID':[101,102,108,104,105],
    'ename':['Apple','Banana','Air','D','E'],df.
    'Dept': ['D1','D2','D3','D4','D5']
}
df = pd.DataFrame(emp)
print(df,'\n')
print(df['ename'].sort_values())
print(df.iloc[0:2])

   empID   ename Dept
0    101   Apple   D1
1    102  Banana   D2
2    108     Air   D3
3    104       D   D4
4    105       E   D5

2       Air
0     Apple
1    Banana
3         D
4         E
Name: ename, dtype: object
   empID   ename Dept
0    101   Apple   D1
1    102  Banana   D2

In [75]:
df.tail(2)

   empID ename Dept
3    104     D   D4
4    105     E   D5

In [76]:
df.head(2)

   empID   ename Dept
0    101   Apple   D1
1    102  Banana   D2

In [1]:
import pandas as pd

empData = {
    'empid':[101,102,103,104,105],
    'ename':['A','B','C','D','E'],
    'DOJ':['12-01-2010','15-01-2012','05-09-2007','17-01-2005','29-12-2000']
}
df = pd.DataFrame(empData)
print(df)
print(df)

   empid ename         DOJ
0    101     A  12-01-2010
1    102     B  15-01-2012
2    103     C  05-09-2007
3    104     D  17-01-2005
4    105     E  29-12-2000
   empid ename         DOJ
0    101     A  12-01-2010
1    102     B  15-01-2012
2    103     C  05-09-2007
3    104     D  17-01-2005
4    105     E  29-12-2000

In [13]:
marks = pd.DataFrame({
    'R':[10,20,30],
    'A':[100,200,300],
    'S':[1,2,3]
},index = ['a','b','c'])
print(marks,'\n')

print(marks['A']['b']) #Col name then row name
print(marks.R.b) #Col name then row name
print(marks.at['c','S']) #Row name then col name
print(marks.iat[0,1]) #Row index then col index

print()

print(marks[marks>=90])
print(marks[(marks>80) & (marks<90)])

print()

marksTransposed = marks.T
print(marks)
print(marksTransposed)

print()

print(marks.sort_index(ascending=False)) #Row indices
print(marks.sort_index(axis=1)) #Col indices

print()

print(marks.sort_values(by='b',axis=1,ascending=False)) 
print(marks.sort_values(by='c',axis=1,ascending=False))
print(marksTransposed.sort_values(by='b',ascending=False))
print(marks.loc['b'].sort_values(ascending=False))

    R    A  S
a  10  100  1
b  20  200  2
c  30  300  3

200
20
3
100

    R    A   S
a NaN  100 NaN
b NaN  200 NaN
c NaN  300 NaN
    R   A   S
a NaN NaN NaN
b NaN NaN NaN
c NaN NaN NaN

    R    A  S
a  10  100  1
b  20  200  2
c  30  300  3
     a    b    c
R   10   20   30
A  100  200  300
S    1    2    3

    R    A  S
c  30  300  3
b  20  200  2
a  10  100  1
     A   R  S
a  100  10  1
b  200  20  2
c  300  30  3

     A   R  S
a  100  10  1
b  200  20  2
c  300  30  3
     A   R  S
a  100  10  1
b  200  20  2
c  300  30  3
     a    b    c
A  100  200  300
R   10   20   30
S    1    2    3
A    200
R     20
S      2
Name: b, dtype: int64

In [15]:
data = {
    'Name':['A','B','C','D','E'],
    'Age':[10,20,30,40,50],
    'City':['V','W','X','Y','Z']
}
df = pd.DataFrame(data)
df.to_csv('Rajendra.csv',index=False)
print("Done")

Done

In [16]:
df2 = pd.read_csv('Data.csv')
print(df2)

  Name  Age City
0    A   10    V
1    B   20    W
2    C   30    X
3    D   40    Y
4    E   50    Z

In [2]:
import pandas as pd

# Define column names from UCI Auto MPG dataset
column_names = [
    "mpg", "cylinders", "displacement", "horsepower", "weight",
    "acceleration", "model_year", "origin", "car_name"
]

# URL of Auto MPG dataset
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data"

# Load dataset
df = pd.read_csv(
    url,
    sep='\s+',   # data separated by spaces
    names=column_names,      # assign column names
    na_values="?"            # missing values marked as '?'
)

# Save to local CSV file
df.to_csv("auto_mpg.csv", index=False)

print("✅ Auto MPG dataset saved as 'auto_mpg.csv'")
print(df.head())

✅ Auto MPG dataset saved as 'auto_mpg.csv'
    mpg  cylinders  displacement  horsepower  weight  acceleration  \
0  18.0          8         307.0       130.0  3504.0          12.0
1  15.0          8         350.0       165.0  3693.0          11.5
2  18.0          8         318.0       150.0  3436.0          11.0
3  16.0          8         304.0       150.0  3433.0          12.0
4  17.0          8         302.0       140.0  3449.0          10.5

   model_year  origin                   car_name
0          70       1  chevrolet chevelle malibu
1          70       1          buick skylark 320
2          70       1         plymouth satellite
3          70       1              amc rebel sst
4          70       1                ford torino

In [3]:
df.head(50)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino
5,15.0,8,429.0,198.0,4341.0,10.0,70,1,ford galaxie 500
6,14.0,8,454.0,220.0,4354.0,9.0,70,1,chevrolet impala
7,14.0,8,440.0,215.0,4312.0,8.5,70,1,plymouth fury iii
8,14.0,8,455.0,225.0,4425.0,10.0,70,1,pontiac catalina
9,15.0,8,390.0,190.0,3850.0,8.5,70,1,amc ambassador dpl
10,15.0,8,383.0,170.0,3563.0,10.0,70,1,dodge challenger se
11,14.0,8,340.0,160.0,3609.0,8.0,70,1,plymouth 'cuda 340
12,15.0,8,400.0,150.0,3761.0,9.5,70,1,chevrolet monte carlo
13,14.0,8,455.0,225.0,3086.0,10.0,70,1,buick estate wagon (sw)
14,24.0,4,113.0,95.0,2372.0,15.0,70,3,toyota corona mark ii
15,22.0,6,198.0,95.0,2833.0,15.5,70,1,plymouth duster
16,18.0,6,199.0,97.0,2774.0,15.5,70,1,amc hornet
17,21.0,6,200.0,85.0,2587.0,16.0,70,1,ford maverick
18,27.0,4,97.0,88.0,2130.0,14.5,70,3,datsun pl510
19,26.0,4,97.0,46.0,1835.0,20.5,70,2,volkswagen 1131 deluxe sedan
20,25.0,4,110.0,87.0,2672.0,17.5,70,2,peugeot 504
21,24.0,4,107.0,90.0,2430.0,14.5,70,2,audi 100 ls
22,25.0,4,104.0,95.0,2375.0,17.5,70,2,saab 99e
23,26.0,4,121.0,113.0,2234.0,12.5,70,2,bmw 2002
24,21.0,6,199.0,90.0,2648.0,15.0,70,1,amc gremlin
25,10.0,8,360.0,215.0,4615.0,14.0,70,1,ford f250
26,10.0,8,307.0,200.0,4376.0,15.0,70,1,chevy c20
27,11.0,8,318.0,210.0,4382.0,13.5,70,1,dodge d200
28,9.0,8,304.0,193.0,4732.0,18.5,70,1,hi 1200d
29,27.0,4,97.0,88.0,2130.0,14.5,71,3,datsun pl510
30,28.0,4,140.0,90.0,2264.0,15.5,71,1,chevrolet vega 2300
31,25.0,4,113.0,95.0,2228.0,14.0,71,3,toyota corona
32,25.0,4,98.0,NaN,2046.0,19.0,71,1,ford pinto
33,19.0,6,232.0,100.0,2634.0,13.0,71,1,amc gremlin
34,16.0,6,225.0,105.0,3439.0,15.5,71,1,plymouth satellite custom
35,17.0,6,250.0,100.0,3329.0,15.5,71,1,chevrolet chevelle malibu
36,19.0,6,250.0,88.0,3302.0,15.5,71,1,ford torino 500
37,18.0,6,232.0,100.0,3288.0,15.5,71,1,amc matador
38,14.0,8,350.0,165.0,4209.0,12.0,71,1,chevrolet impala
39,14.0,8,400.0,175.0,4464.0,11.5,71,1,pontiac catalina brougham
40,14.0,8,351.0,153.0,4154.0,13.5,71,1,ford galaxie 500
41,14.0,8,318.0,150.0,4096.0,13.0,71,1,plymouth fury iii
42,12.0,8,383.0,180.0,4955.0,11.5,71,1,dodge monaco (sw)
43,13.0,8,400.0,170.0,4746.0,12.0,71,1,ford country squire (sw)
44,13.0,8,400.0,175.0,5140.0,12.0,71,1,pontiac safari (sw)
45,18.0,6,258.0,110.0,2962.0,13.5,71,1,amc hornet sportabout (sw)
46,22.0,4,140.0,72.0,2408.0,19.0,71,1,chevrolet vega (sw)
47,19.0,6,250.0,100.0,3282.0,15.0,71,1,pontiac firebird
48,18.0,6,250.0,88.0,3139.0,14.5,71,1,ford mustang
49,23.0,4,122.0,86.0,2220.0,14.0,71,1,mercury capri 2000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    float64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car_name      398 non-null    object
dtypes: float64(5), int64(3), object(1)
memory usage: 28.1+ KB

In [6]:
df.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050,1.572864
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627,0.802055
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000,1.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000

In [10]:
df.describe(percentiles=[0.3,0.6,0.8])

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050,1.572864
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627,0.802055
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000
30%,18.000000,4.000000,112.000000,80.000000,2301.000000,14.200000,73.000000,1.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000,1.000000
60%,25.000000,6.000000,200.000000,100.000000,3085.200000,16.000000,77.000000,1.000000
80%,31.000000,8.000000,304.600000,140.000000,3806.000000,17.760000,80.000000,2.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000

In [11]:
df['car_name'].describe()

count            398
unique           305
top       ford pinto
freq               6
Name: car_name, dtype: object

In [12]:
df.describe(include='all')

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000,398.000000,398
unique,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,305
top,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,ford pinto
freq,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,6
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050,1.572864,NaN
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627,0.802055,NaN
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000,1.000000,NaN
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000,1.000000,NaN
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000,1.000000,NaN
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000,2.000000,NaN
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,3.000000,NaN

In [13]:
df.shape

(398, 9)

In [14]:
df.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'car_name'],
      dtype='object')

In [16]:
col_list = list(df.columns)

['mpg',
 'cylinders',
 'displacement',
 'horsepower',
 'weight',
 'acceleration',
 'model_year',
 'origin',
 'car_name']

In [17]:
print(df.duplicated())

0      False
1      False
2      False
3      False
4      False
       ...
393    False
394    False
395    False
396    False
397    False
Length: 398, dtype: bool

In [18]:
print(df.drop_duplicates())

      mpg  cylinders  displacement  horsepower  weight  acceleration  \
0    18.0          8         307.0       130.0  3504.0          12.0
1    15.0          8         350.0       165.0  3693.0          11.5
2    18.0          8         318.0       150.0  3436.0          11.0
3    16.0          8         304.0       150.0  3433.0          12.0
4    17.0          8         302.0       140.0  3449.0          10.5
..    ...        ...           ...         ...     ...           ...
393  27.0          4         140.0        86.0  2790.0          15.6
394  44.0          4          97.0        52.0  2130.0          24.6
395  32.0          4         135.0        84.0  2295.0          11.6
396  28.0          4         120.0        79.0  2625.0          18.6
397  31.0          4         119.0        82.0  2720.0          19.4

     model_year  origin                   car_name
0            70       1  chevrolet chevelle malibu
1            70       1          buick skylark 320
2            70       1         plymouth satellite
3            70       1              amc rebel sst
4            70       1                ford torino
..          ...     ...                        ...
393          82       1            ford mustang gl
394          82       2                  vw pickup
395          82       1              dodge rampage
396          82       1                ford ranger
397          82       1                 chevy s-10

[398 rows x 9 columns]

In [59]:
data = {
    'Name': ['A','B','C','A','B','D','C'],
    'Age':[10,20,30,10,20,40,30],
    'City':['C1','C2','C3','C1','C2','C4','C5']
}
df =pd.DataFrame(data)
print(df)
df.duplicated()

  Name  Age City
0    A   10   C1
1    B   20   C2
2    C   30   C3
3    A   10   C1
4    B   20   C2
5    D   40   C4
6    C   30   C5

0    False
1    False
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [23]:
df.drop_duplicates()

  Name  Age City
0    A   10   C1
1    B   20   C2
2    C   30   C3
5    D   40   C4

In [24]:
df.drop_duplicates(inplace=True)

In [26]:
print(df)

  Name  Age City
0    A   10   C1
1    B   20   C2
2    C   30   C3
5    D   40   C4

In [36]:
df.drop_duplicates(keep="last")

  Name  Age City
2    C   30   C3
3    A   10   C1
4    B   20   C2
5    D   40   C4

In [31]:
df

  Name  Age City
0    A   10   C1
1    B   20   C2
2    C   30   C3
5    D   40   C4

In [44]:
df.drop_duplicates(subset=['Age','Name'])

  Name  Age City
0    A   10   C1
1    B   20   C2
2    C   30   C3
5    D   40   C4

In [46]:
df.drop_duplicates(keep=False)

  Name  Age City
2    C   30   C3
5    D   40   C4
6    C   30   C5

In [49]:
df.duplicated().sum()

2

In [60]:
df.drop_duplicates(inplace=True,keep=False)

In [61]:
df

  Name  Age City
2    C   30   C3
5    D   40   C4
6    C   30   C5

In [74]:
import numpy as np
data = {
    'Name': ['A','B','C',np.nan,np.nan,'D',np.nan],
    'Age':[10,20,30,np.nan,np.nan,40,np.nan],
    'City':['C1','C2','C3',np.nan,np.nan,'C4','C5']
}
df =pd.DataFrame(data)
print(df)

  Name   Age City
0    A  10.0   C1
1    B  20.0   C2
2    C  30.0   C3
3  NaN   NaN  NaN
4  NaN   NaN  NaN
5    D  40.0   C4
6  NaN   NaN   C5

In [64]:
df.isna()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False  False
3   True   True   True
4   True   True   True
5  False  False  False
6   True   True  False

In [65]:
df.isna().sum()

Name    3
Age     3
City    2
dtype: int64

In [66]:
df.dropna()

  Name   Age City
0    A  10.0   C1
1    B  20.0   C2
2    C  30.0   C3
5    D  40.0   C4

In [68]:
df.dropna(how='all')

  Name   Age City
0    A  10.0   C1
1    B  20.0   C2
2    C  30.0   C3
5    D  40.0   C4
6  NaN   NaN   C5

In [73]:
df.dropna(subset=['City'])

  Name   Age City
0    A  10.0   C1
1    B  20.0   C2
2    C  30.0   C3
5    D  40.0   C4
6  NaN   NaN   C5

In [78]:
fill = df.copy()
fill['Age']=fill['Age'].fillna(0)
fill['City']=  fill['City'].fillna('Unknown')
fill['Name'] = fill['Name'].fillna(0)
print(fill)

  Name   Age     City
0    A  10.0       C1
1    B  20.0       C2
2    C  30.0       C3
3    0   0.0  Unknown
4    0   0.0  Unknown
5    D  40.0       C4
6    0   0.0       C5